FinalDAPP/dsgt4start/dsgt4start/target/dsgt4-2.0/WEB-INF/classes/wsdl/GetWineResponseWsdl.wsdl

<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:sch="http://winemenu.io/gt/webservice" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://winemenu.io/gt/webservice" targetNamespace="http://winemenu.io/gt/webservice">
<wsdl:types>
<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" elementFormDefault="qualified" targetNamespace="http://winemenu.io/gt/webservice">
<xs:element name="getWineRequest">
<xs:complexType>
<xs:sequence>
<xs:element name="name" type="xs:string"/>
</xs:sequence>
</xs:complexType>
</xs:element>
<xs:element name="getWineResponse">
<xs:complexType>
<xs:sequence>
<xs:element name="wine" type="tns:wine"/>
</xs:sequence>
</xs:complexType>
</xs:element>
<xs:element name="getCheapestWineRequest">
<xs:complexType>
<xs:sequence> </xs:sequence>
</xs:complexType>
</xs:element>
<xs:element name="getCheapestWineResponse">
<xs:complexType>
<xs:sequence>
<xs:element name="wine" type="tns:wine"/>
</xs:sequence>
</xs:complexType>
</xs:element>
<xs:element name="getMostExpensiveWineRequest">
<xs:complexType>
<xs:sequence> </xs:sequence>
</xs:complexType>
</xs:element>
<xs:element name="getMostExpensiveWineResponse">
<xs:complexType>
<xs:sequence>
<xs:element name="wine" type="tns:wine"/>
</xs:sequence>
</xs:complexType>
</xs:element>
<xs:element name="getOrderRequest">
<xs:complexType>
<xs:sequence>
<xs:element name="order" type="tns:order"/>
</xs:sequence>
</xs:complexType>
</xs:element>
<xs:element name="getOrderResponse">
<xs:complexType>
<xs:sequence>
<xs:element name="responseText" type="xs:string"/>
</xs:sequence>
</xs:complexType>
</xs:element>
<xs:element name="getWineCardRequest">
<xs:complexType>
<xs:sequence> </xs:sequence>
</xs:complexType>
</xs:element>
<xs:element name="getWineCardResponse">
<xs:complexType>
<xs:sequence>
<xs:element maxOccurs="unbounded" minOccurs="0" name="wine" type="tns:wine"/>
</xs:sequence>
</xs:complexType>
</xs:element>
<xs:complexType name="order">
<xs:sequence>
<xs:element name="orderNumber" type="xs:long"/>
<xs:element maxOccurs="unbounded" minOccurs="0" name="wineName" type="xs:string"/>
<xs:element minOccurs="0" name="specialInstructions" type="xs:string"/>
<xs:element name="timestamp" type="xs:string"/>
<xs:element name="deliveryAddress" type="xs:string"/>
</xs:sequence>
</xs:complexType>
<xs:complexType name="wine">
<xs:sequence>
<xs:element name="name" type="xs:string"/>
<xs:element name="year" type="xs:int"/>
<xs:element name="price" type="xs:double"/>
<xs:element name="percentage" type="xs:float"/>
<xs:element name="tastePallet" type="tns:aroma"/>
<xs:element name="quantity" type="xs:int"/>
</xs:sequence>
</xs:complexType>
<xs:simpleType name="aroma">
<xs:restriction base="xs:string">
<xs:enumeration value="CITRUS"/>
<xs:enumeration value="BLACKBERRY"/>
<xs:enumeration value="CHERRY"/>
<xs:enumeration value="PASSION_FRUIT"/>
<xs:enumeration value="ROSE"/>
<xs:enumeration value="JASMINE"/>
<xs:enumeration value="VIOLET"/>
<xs:enumeration value="ELDERFLOWER"/>
<xs:enumeration value="PEPPER"/>
<xs:enumeration value="CLOVE"/>
<xs:enumeration value="CINNAMON"/>
<xs:enumeration value="VANILLA"/>
<xs:enumeration value="WET STONE"/>
<xs:enumeration value="SLATE"/>
<xs:enumeration value="SMOKE"/>
<xs:enumeration value="CEDAR"/>
<xs:enumeration value="PLUM"/>
</xs:restriction>
</xs:simpleType>
</xs:schema>
</wsdl:types>
<wsdl:message name="getOrderResponse">
<wsdl:part element="tns:getOrderResponse" name="getOrderResponse"> </wsdl:part>
</wsdl:message>
<wsdl:message name="getMostExpensiveWineRequest">
<wsdl:part element="tns:getMostExpensiveWineRequest" name="getMostExpensiveWineRequest"> </wsdl:part>
</wsdl:message>
<wsdl:message name="getOrderRequest">
<wsdl:part element="tns:getOrderRequest" name="getOrderRequest"> </wsdl:part>
</wsdl:message>
<wsdl:message name="getWineRequest">
<wsdl:part element="tns:getWineRequest" name="getWineRequest"> </wsdl:part>
</wsdl:message>
<wsdl:message name="getWineCardResponse">
<wsdl:part element="tns:getWineCardResponse" name="getWineCardResponse"> </wsdl:part>
</wsdl:message>
<wsdl:message name="getCheapestWineResponse">
<wsdl:part element="tns:getCheapestWineResponse" name="getCheapestWineResponse"> </wsdl:part>
</wsdl:message>
<wsdl:message name="getCheapestWineRequest">
<wsdl:part element="tns:getCheapestWineRequest" name="getCheapestWineRequest"> </wsdl:part>
</wsdl:message>
<wsdl:message name="getWineCardRequest">
<wsdl:part element="tns:getWineCardRequest" name="getWineCardRequest"> </wsdl:part>
</wsdl:message>
<wsdl:message name="getWineResponse">
<wsdl:part element="tns:getWineResponse" name="getWineResponse"> </wsdl:part>
</wsdl:message>
<wsdl:message name="getMostExpensiveWineResponse">
<wsdl:part element="tns:getMostExpensiveWineResponse" name="getMostExpensiveWineResponse"> </wsdl:part>
</wsdl:message>
<wsdl:portType name="WinesPort">
<wsdl:operation name="getOrder">
<wsdl:input message="tns:getOrderRequest" name="getOrderRequest"> </wsdl:input>
<wsdl:output message="tns:getOrderResponse" name="getOrderResponse"> </wsdl:output>
</wsdl:operation>
<wsdl:operation name="getMostExpensiveWine">
<wsdl:input message="tns:getMostExpensiveWineRequest" name="getMostExpensiveWineRequest"> </wsdl:input>
<wsdl:output message="tns:getMostExpensiveWineResponse" name="getMostExpensiveWineResponse"> </wsdl:output>
</wsdl:operation>
<wsdl:operation name="getWine">
<wsdl:input message="tns:getWineRequest" name="getWineRequest"> </wsdl:input>
<wsdl:output message="tns:getWineResponse" name="getWineResponse"> </wsdl:output>
</wsdl:operation>
<wsdl:operation name="getWineCard">
<wsdl:input message="tns:getWineCardRequest" name="getWineCardRequest"> </wsdl:input>
<wsdl:output message="tns:getWineCardResponse" name="getWineCardResponse"> </wsdl:output>
</wsdl:operation>
<wsdl:operation name="getCheapestWine">
<wsdl:input message="tns:getCheapestWineRequest" name="getCheapestWineRequest"> </wsdl:input>
<wsdl:output message="tns:getCheapestWineResponse" name="getCheapestWineResponse"> </wsdl:output>
</wsdl:operation>
</wsdl:portType>
<wsdl:binding name="WinesPortSoap11" type="tns:WinesPort">
<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
<wsdl:operation name="getOrder">
<soap:operation soapAction=""/>
<wsdl:input name="getOrderRequest">
<soap:body use="literal"/>
</wsdl:input>
<wsdl:output name="getOrderResponse">
<soap:body use="literal"/>
</wsdl:output>
</wsdl:operation>
<wsdl:operation name="getMostExpensiveWine">
<soap:operation soapAction=""/>
<wsdl:input name="getMostExpensiveWineRequest">
<soap:body use="literal"/>
</wsdl:input>
<wsdl:output name="getMostExpensiveWineResponse">
<soap:body use="literal"/>
</wsdl:output>
</wsdl:operation>
<wsdl:operation name="getWine">
<soap:operation soapAction=""/>
<wsdl:input name="getWineRequest">
<soap:body use="literal"/>
</wsdl:input>
<wsdl:output name="getWineResponse">
<soap:body use="literal"/>
</wsdl:output>
</wsdl:operation>
<wsdl:operation name="getWineCard">
<soap:operation soapAction=""/>
<wsdl:input name="getWineCardRequest">
<soap:body use="literal"/>
</wsdl:input>
<wsdl:output name="getWineCardResponse">
<soap:body use="literal"/>
</wsdl:output>
</wsdl:operation>
<wsdl:operation name="getCheapestWine">
<soap:operation soapAction=""/>
<wsdl:input name="getCheapestWineRequest">
<soap:body use="literal"/>
</wsdl:input>
<wsdl:output name="getCheapestWineResponse">
<soap:body use="literal"/>
</wsdl:output>
</wsdl:operation>
</wsdl:binding>
<wsdl:service name="WinesPortService">
<wsdl:port binding="tns:WinesPortSoap11" name="WinesPortSoap11">
<soap:address location="http://dapp.uksouth.cloudapp.azure.com:12000/ws"/>
</wsdl:port>
</wsdl:service>
</wsdl:definitions>