FinalDAPP/dsgt-soap-wine/producingwebservice/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://winemenu.io/gt/webservice">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getWineRequest>
            <gs:name>Portobello</gs:name>
        </gs:getWineRequest>
    </soapenv:Body>
</soapenv:Envelope>