FinalDAPP/Broker/requestmenu.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://winemenu.io/gt/webservice">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getWineCardRequest/>
    </soapenv:Body>
</soapenv:Envelope>