dsgt-final-project/dsgt-soap-wine/producingwebservice/requestorder.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gs="http://winemenu.io/gt/webservice">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getOrderRequest>
            <gs:order>
                <gs:orderNumber/>
                <gs:wineName>Chardonnay</gs:wineName>
                <gs:wineName>Merlot</gs:wineName>
                <gs:specialInstructions>Special instructions here</gs:specialInstructions>
                <gs:timestamp/>
                <gs:deliveryAddress>Andreas Vesaliusstraat 13, 3000 Leuven</gs:deliveryAddress>
            </gs:order>
        </gs:getOrderRequest>
    </soapenv:Body>
</soapenv:Envelope>
